### DATA CLEANING
### isnull() , notnull() , fillna() (0,mean,backpro) ,dropna()

In [3]:
import pandas as pd

In [97]:
data = pd.read_csv('Ecommerce Customers')
ecom = pd.DataFrame(data)
ecom.head(10)

,Email,Address,Avatar,Avg. Session Length,Time on App,Time on Website,Length of Membership,Yearly Amount Spent
0,mstephenson@fernandez.com,"835 Frank Tunnel\nWrightmouth, MI 82180-9605",Violet,34.497268,12.655651,39.577668,4.082621,587.951054
1,hduke@hotmail.com,"4547 Archer Common\nDiazchester, CA 06566-8576",DarkGreen,31.926272,11.109461,37.268959,2.664034,392.204933
2,pallen@yahoo.com,"24645 Valerie Unions Suite 582\nCobbborough, D...",Bisque,33.000915,11.330278,37.110597,4.104543,487.547505
3,riverarebecca@gmail.com,"1414 David Throughway\nPort Jason, OH 22070-1220",SaddleBrown,34.305557,13.717514,36.721283,3.120179,581.852344
4,mstephens@davidson-herman.com,"14023 Rodriguez Passage\nPort Jacobville, PR 3...",MediumAquaMarine,33.330673,12.795189,37.536653,4.446308,599.406092
5,alvareznancy@lucas.biz,"645 Martha Park Apt. 611\nJeffreychester, MN 6...",FloralWhite,33.871038,12.026925,34.476878,5.493507,637.102448
6,katherine20@yahoo.com,"68388 Reyes Lights Suite 692\nJosephbury, WV 9...",DarkSlateBlue,32.021596,11.366348,36.683776,4.685017,521.572175
7,awatkins@yahoo.com,Unit 6538 Box 8980\nDPO AP 09026-4941,Aqua,32.739143,12.351959,37.373359,4.434273,549.904146
8,vchurch@walter-martinez.com,"860 Lee Key\nWest Debra, SD 97450-0495",Salmon,33.987773,13.386235,37.534497,3.273434,570.200409
9,bonnie69@lin.biz,"PSC 2734, Box 5255\nAPO AA 98456-7482",Brown,31.936549,11.814128,37.145168,3.202806,427.199385

In [3]:
ecom['Yearly Amount Spent'].isnull().value_counts()

False    500
Name: Yearly Amount Spent, dtype: int64

In [4]:
data = pd.read_csv('data.csv')
employees = pd.DataFrame(data)
employees.head(10)

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk       NaN
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk       NaN

In [5]:
data['salary'].isnull().value_counts()

False    4
True     2
Name: salary, dtype: int64

In [6]:
data = pd.read_csv('data.csv')

In [7]:
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk       NaN
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk       NaN

In [8]:
data['salary'].isnull().value_counts()

False    4
True     2
Name: salary, dtype: int64

In [9]:
data['salary'] = data['salary'].fillna(data['salary'].mean())
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk  750000.0
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk  750000.0

In [10]:
data =pd.read_csv('data.csv')

In [11]:
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk       NaN
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk       NaN

In [12]:
#back propogation method
data['salary'] = data['salary'].fillna(method='pad')

In [13]:
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk  700000.0
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk  900000.0

#### fillna():
CONCLUSION : WE CAN FILL NaN VALUES USING <br>
1) 0'S <br>
2) MEAN OF THE COLUMN <br>
3) BACK PROPOGATION METHOD <br>

In [14]:
data =pd.read_csv('data.csv')
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk       NaN
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk       NaN

In [15]:
data = data.dropna()
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0

#### dropna()
OR, <br>
        WE CAN DROP ALL NaN VALUES USING dropna()

====================================================================================
### STRING OPS:
#### SUBSTRING:

In [16]:
data['salary'][0:2]

0    600000.0
1    700000.0
Name: salary, dtype: float64

#### FILTERING:

In [17]:
data[data['emp_name']=="vaibhavi"]

       company  emp_name   job    salary
4  tech verito  vaibhavi  mbbs  900000.0

In [18]:
data[data['salary']>=700000]

       company  emp_name             job    salary
1     teradata     vivek    data analyst  700000.0
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0

#### MERGING:

In [66]:
a1 = data[0:2]
a2 = data[2:5]
print(a1)
print("\n")
print(a2)

      company emp_name            job    salary
0  persistent  manisha  data engineer  600000.0
1    teradata    vivek   data analyst  700000.0


       company  emp_name             job    salary
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0

In [62]:
combo = pd.concat([a1,a2],keys=['part1','part2'])
print(combo)

             company  emp_name             job    salary
part1 0   persistent   manisha   data engineer  600000.0
      1     teradata     vivek    data analyst  700000.0
part2 3  elastic run   meghana  data scientist  800000.0
      4  tech verito  vaibhavi            mbbs  900000.0

#### UPPERCASE , LOWERCASE , LENGTH , SPLIT, REPLACE

In [70]:
data['emp_name'].str.upper()

0     MANISHA
1       VIVEK
3     MEGHANA
4    VAIBHAVI
Name: emp_name, dtype: object

In [71]:
data['company'].str.len()

0    10
1     8
3    11
4    11
Name: company, dtype: int64

In [72]:
data['emp_name'].str.lower()

0     manisha
1       vivek
3     meghana
4    vaibhavi
Name: emp_name, dtype: object

In [77]:
data['emp_name'].str.replace('meghana','meghu')

0     manisha
1       vivek
3       meghu
4    vaibhavi
Name: emp_name, dtype: object

In [80]:
data['emp_name'].str.split('a')

0     [m, nish, ]
1         [vivek]
3     [megh, n, ]
4    [v, ibh, vi]
Name: emp_name, dtype: object

In [81]:
data

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0

In [82]:
data['email']=['mgm@gmail.com','vkj@gmail.com','mvj@gmail.com','vvj@gmail.com']

In [83]:
data

       company  emp_name             job    salary          email
0   persistent   manisha   data engineer  600000.0  mgm@gmail.com
1     teradata     vivek    data analyst  700000.0  vkj@gmail.com
3  elastic run   meghana  data scientist  800000.0  mvj@gmail.com
4  tech verito  vaibhavi            mbbs  900000.0  vvj@gmail.com

In [23]:
data['email']=['mgm@gmail.com','vkj@gmail.com','mvj@yahoo.com','vvj@gmail.com']

/home/meghana/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [24]:
data

       company  emp_name             job    salary          email
0   persistent   manisha   data engineer  600000.0  mgm@gmail.com
1     teradata     vivek    data analyst  700000.0  vkj@gmail.com
3  elastic run   meghana  data scientist  800000.0  mvj@yahoo.com
4  tech verito  vaibhavi            mbbs  900000.0  vvj@gmail.com

In [25]:
a = data['email'].str.split('@')
a

0    [mgm, gmail.com]
1    [vkj, gmail.com]
3    [mvj, yahoo.com]
4    [vvj, gmail.com]
Name: email, dtype: object

In [26]:
type(data)

pandas.core.frame.DataFrame

In [27]:
type(employees)

pandas.core.frame.DataFrame

In [28]:
employees

       company  emp_name             job    salary
0   persistent   manisha   data engineer  600000.0
1     teradata     vivek    data analyst  700000.0
2      infosys     sagar           clerk       NaN
3  elastic run   meghana  data scientist  800000.0
4  tech verito  vaibhavi            mbbs  900000.0
5          tcs       ram           clerk       NaN

In [29]:
data.drop(columns =['company'])

   emp_name             job    salary          email
0   manisha   data engineer  600000.0  mgm@gmail.com
1     vivek    data analyst  700000.0  vkj@gmail.com
3   meghana  data scientist  800000.0  mvj@yahoo.com
4  vaibhavi            mbbs  900000.0  vvj@gmail.com

In [30]:
data.drop(columns =['company'],inplace=False)

   emp_name             job    salary          email
0   manisha   data engineer  600000.0  mgm@gmail.com
1     vivek    data analyst  700000.0  vkj@gmail.com
3   meghana  data scientist  800000.0  mvj@yahoo.com
4  vaibhavi            mbbs  900000.0  vvj@gmail.com

In [31]:
data

       company  emp_name             job    salary          email
0   persistent   manisha   data engineer  600000.0  mgm@gmail.com
1     teradata     vivek    data analyst  700000.0  vkj@gmail.com
3  elastic run   meghana  data scientist  800000.0  mvj@yahoo.com
4  tech verito  vaibhavi            mbbs  900000.0  vvj@gmail.com

In [34]:
data.drop(columns =['job'],inplace=True)

In [35]:
data

   emp_name    salary          email
0   manisha  600000.0  mgm@gmail.com
1     vivek  700000.0  vkj@gmail.com
3   meghana  800000.0  mvj@yahoo.com
4  vaibhavi  900000.0  vvj@gmail.com